[{"id":"0_ptsd","text":"I (23m) experienced my father (55m) having a seizure and hitting the floor, and now I am experiencing extreme moodswings.  Can I prevent these things? (more in post) I'll try to keep this short and simple as possible.  But my father had a seizure about 2 and a half weeks ago.  I was not there in the same room when it happened, but I knew SOMETHING was wrong when i heard the ictal cry (Google if you are not aware of what this is, but it's pretty much a loud groan, all of the air escaping through the larynx as the seizure starts.  I heard the ictal cry and turned the corner and saw my father, stiff, falling to the ground from a standing position, and watched him hit his head, as he was already half of the way down when I saw him.    \n\n\nIt was only me, my sister, and father home at the time.  I of course helped him in the moment during the seizure, keeping him on his side, calling 911, etc.  He is doing alright now (this was his first tonic seizure, not a diagnosed epileptic as of yet) But, weeks after, i cannot stop thinking about this, especially late at night.    \n\n\ni get up and our of my room every time i hear ANYTHING loud from in the house, since it is typically only me and my father home, while my mother works.  I am CONSTANTLY checking up on him, worried that i will walk into another seizure in the moment.  I have a grave feeling in my stomach every time i leave my room to check on him.    \n\n\nAlso, a days ago, I woke up and strictly remember having a dream about the seizure experience, like a replay of that day.  And that day, i have never been so sad\/angry (i think i suppressed my sadness and ended up getting very irate) which is super abnormal for me.  Punching my desk getting mad at games when I never do.  Getting mad at friends for saying silly things (I attacked my friend for buying another iphone and supporting apple)   \n\n\nI don't have a license, and I have to get one now, since my father cannot drive for 6 months.  This is giving me a ton of anxiety, especially since I am being forced in a way."},{"id":"1_counseling","text":"What can I do to stop grieving my mother’s death?  When I am awake I just cry every day. I don't have anyone to talk to. I need help; I am still cry over her.  Will I ever stop crying? It’s been 3 years."},{"id":"2_ptsd","text":"feeling lost and confused after reporting abuse to police i have recently reported some sexual abuse i suffered as a child \/ young teen to the police and there's an ongoing investigation. the police have taken my phone for evidence and they've had it for over a month. at the moment i just feel so lost. they're not great at keeping in touch and there's not many updates. i feel alone and lost and confused. i don't know what's happening and i am so stressed about it all. \n\n**does anyone generally know how long a police investiagtion into abuse (UK) takes? and how to cope with it all? and what happens in the end? how long will he get? was it worth it?** \n\n***i feel like i've made a big mistake***"},{"id":"3_counseling","text":"I have a relative who is in his twenties.  He was in a drug rehabilitation program and got kicked out for using drugs again. No one informed family that he was using drugs again.  He subsequently overdosed and was found dead.\r\nIs their accountability of counselors, therapists or the halfway house for not reporting that he had relapsed? Is there a legal case for failing to report?"},{"id":"4_incel","text":"the system and living innawoods. Nigga! The system still exists! Imperialism takes over and the Liberal establishment sends drones to firebomb your house and a tranny rape squad to rape the survivors to death."},{"id":"5_incel","text":"not_here_4_points said: Why stop at that? I'd rather death squads to kill people like us tbh. "},{"id":"6_ptsd","text":"Iv had ptsd for 10 Years, I was never told what to expect or what a flash back is.  A little insight in to my more manic\/panicky moments would be good Iv had PTSD since I was eight, following a car crash on the way to school.   The car crashed on mine and my mums side of the car.   My mum fractured her spine and the first few days\/week in the hospital she couldn’t stand with out pain. \nFor the first few weeks of being back at school we walked the 2 miles in the frozen over rurel farmers fields to get there and back.  I grow more and more disinclined to attend school.    I would do anything to hide, somtimes when we stared driving to school again I’d locking my self in the car when my dad and my sister got out and refuse to unlock the doors until I was promised to go home.   I felt numb and anxious I’d cry my self to sleep every night and feel anxious about school the next morning and then when I didn’t go in I’d feel guilty for not going in.  But if I did I would wonder the buildings and playgrounds with a fake smile on my face because I didn’t want anymore people coming up to me to ask if I was okey and if I was sure.   I would reassure them with lies and somethings walk home without telling anyone. \nBecause I stayed at home rather than go to school I watch my mum grow more and more inclined to stay in bed as she became increasingly dependent on tramadol.  Her addiction lasted 3 or so years.   When she recovered from her addiction she put her healthy weight back on, her bra size went from an a\/b cup back up to a d\/dd.  I know because she gave me her old bra and said it was from that time\n\nIv seen over 5 therapist (art, edmr, talky, and one I can’t remember the name off) and at least that again with more specialist therapists in one of sessions.   Iv developers a kinda phobia tonwards them.  I don’t really talk in therapy session and the reply’s I give are the ones that mean the least interaction and communication.   My reaction to therapy was stronger that my reaction to school\n\nThere’s an emotion I feel when I’m in a state sometimes, it’s indescribable and like nothing else I experienced."},{"id":"7_ptsd","text":"question about ptsd My ex gf always claimed that she has ptsd from a traumatic event when she was a child. Basicaly she saw her father slap her mother in the face. She says that that caused her ptsd. I dont want to be mean or anything but she is basicaly acting like a bitch and doesnt want to help others because she has ptsd. Uses it as an excuse for everything."},{"id":"8_counseling","text":"My coworkers are making false statements about me to the boss, saying I have mood swings. They have no proof to back it up. Can my employer make me see a therapist of their choice?"},{"id":"9_incel","text":" >pillow fist >not rigged into oblivion >former boxing world champion was beaten by a garbage UFC reject IN BOXING (Lobov vs Malignaggi) Nice semen slurping ”sport” you got there, buddy."},{"id":"10_incel","text":"didn't resist and stay in his room after the \"rape\" and fucked him again in the future jfl. They all said yes to the sex the moment they saw his face and he invites them to his room. If one of us tried that, we wouldn't even get them in the room."},{"id":"11_counseling","text":"This is my recovery, and I don't feel that it is okay for them to ask this. They told me it is policy due to the fact that I may run into a peer there. I am a peer counselor in the small community that I grew up in. I am in recovery myself. I was asked to come work for this organization after I was two years sober (I was in treatment in this organization). I work with mental health peers and run life skill groups. I don't work with substance peers."},{"id":"12_incel","text":"I'm a hardcore leftist. I mean... I'm a full blown commie who despises rich people and the elite. That being said... SJW values are destroying the left. Being left doesn't mean being a cuck or holding hands and saying kumbaya. Most communist contries hate gays and religion (for exemple). Being leftist was supposed to fight AGAINST getting cucked. Those fat cats thathat get rich rigging the system? Kill them and divide their stuff. No one is left behind and everyone is TRULY equal. No matter if you are men, woman, gay, Trans, ethnic, Chad or Stacy."},{"id":"13_counseling","text":"My dad makes me feel like shit and like I'm worthless.  He calls me names and makes me feel depressed.  I want to move out because I swear if I stay here, I'm going to lose it. What can I do?"},{"id":"14_counseling","text":"I was raped a couple months ago, Since then, along with other unfortunately events that have occurred, I have been having trouble feeling emotions. It's almost as if I'm a sociopath lacking any feeling. What can I do to change this?"},{"id":"15_ptsd","text":"com\/in\/gina-nobile-a3597349\/\nhttps:\/\/twitter. com\/gnobile9\nhttps:\/\/www. instagram. com\/ginanobile\/\n\nBlog: http:\/\/laagina. blogspot. com\/\n\n."},{"id":"16_incel","text":"I don't even know what to say man, this is beyond fucked up I would first tell your parents the truth no matter how much it hurts because right now your parents are killing themselves for nothing and by waiting longer it's only gonna get worse. I would also go on to explain how the bullying affected your grades and that's why you couldn't graduate with good grades."},{"id":"17_incel","text":"I don't wanna go to SEA for sex, I prefer East Asians because they are cleaner I found out before covid you could travel to North Korea I was wondering is sex legal there between white male and Asian women, or will I be killed?"},{"id":"18_ptsd","text":"Experience reporting sexual abuse? Is it worth it? (X-post from \/r\/rapecounseling) I was raped repeatedly by a family member over the course of about 4 years as a child. In my state there is no statute of limitations on reporting and after years and years of trauma counseling I finally feel the urge to report what happened and press charges. Do any of you have experience with this? What are the first steps? Is it even worth the trouble? Will I have to see him again? \n\nI’m a little torn because as much as I want justice for what happened to me I definitely don’t want to re-traumatize myself by reliving everything in front of strangers  just to have my rapist get off. I know that happens often, and I’m worried that after ten years it’s no longer realistic to have him convicted. \n\nAny advice or personal experiences would be really helpful"},{"id":"19_incel","text":" You're sad because you're ugly. Same reason if you're depressed. It's all about the face."},{"id":"20_ptsd","text":"And then with my friend who I think abused me, I guess I did see the red flags and (for whatever reason) chose to ignore them, because I thought I could control\/handle it.  Same with the abusive ex coming to think of it.  So maybe it's that I don't avoid these situations enough?? (Could my trauma have desensitised me to certain warning signs?)\n\n&amp;#x200B;\n\nBut then part of me also thinks, is it about how I'm interpreting situations?\n\n&amp;#x200B;\n\nWhen I was 17 I went through a highly traumatic series of events, and I was only able to recover by recognising and understanding abuse.  I'd experienced things like gaslighting, I became aware of common misconceptions people have - I guess I had to learn about abuse \/ healthy relationships on a logical level, before going on to experience them, because my trauma had been so bad and completely messed up the way I viewed relationships? So I had to reform my ideas step by step using logic\/principles?\n\n&amp;#x200B;\n\nSo there's two ways of looking at this - awareness and projection. \n\n&amp;#x200B;\n\nIt's definitely true that I see abuse where others don't.  Also I don't \\*always\\* mean it as such a seriously bad thing - I mean obviously it's unacceptable, does have a negative impact, and needs to be stopped.  But I don't think \"traumatic\" or \"super emotionally damaging\" are prerequisites (though they obviously often come with it) - I think it's just a significant violation of someone's boundaries in a way that doesn't have a reasonable explanation, accompanied by gaslighting or denial (though gaslighting doesn't need to be there when it's severe).  So say with my ex - I feel like the emotional manipulation was traumatic, but the specific individual instances of sexual abuse (and the gaslighting that came with those) wasn't traumatic and didn't need to be to \"count\" as abusive?\n\nI can think of someone or a situation as \"abusive\" without thinking it defines them as a person, they'd act like that in all contexts, or that they were consciously meaning to do harm."},{"id":"21_ptsd","text":"Trouble with anxiety and dissociation I feel like lately I’m either in a dead panic or completely fuzzy and detached from reality. I just want to feel clear and happy again but the constant battle to find a middle ground between panic and dissociation is fucking killing me. I’m currently in EMDR and remembered some memories of my trauma that I hadn’t before, not sure if they were repressed or if going over it all in my head again brought them up but I’m pretty sure that’s what’s triggering this. \n\nI don’t know what I’m even looking for by posting this, I guess I’m just venting. If anyone’s has similar experiences or if you have any advice I’d love to hear it "},{"id":"22_counseling","text":"I was violently raped by another women who was my friend of 13 years. I’m having bad flashbacks. I’m scared to sleep because I see it in my dreams. I don't leave the house because I have panic attacks."},{"id":"23_ptsd","text":"Intrusive thoughts I’m a highschool swimmer. Practices are 3 hours long and we barely stop, how do i stop the thoughts from coming when my mind has so much time to think and nothing to entertain it."},{"id":"24_ptsd","text":"Triggered There is a place. Where \"why\" is a question. And \"why\" is not a question. \n\nAnd certainly it wants an answer - but the answers can't be given. It's screamed out in a whisper with hands clinched, teeth shown and the jaw locked tight. \n\nAnger runs with blood through the veins. But all this self medicating can't dissolve it. Neither will self inflicting pain quiet it. Virtue is removed, stripped. \n\nThis is the calm within the storm. \n\n- the quiet one sitting next to you \n"},{"id":"25_incel","text":" Perfect analogy of being an ugly male. He stopped moving is antenna cause and achieved ant depression."},{"id":"26_counseling","text":"I have severe anxiety and have tried everything. Everything makes it worst.The only thing that helps is my emotional support animal."},{"id":"27_counseling","text":"My boyfriend’s sneaky and puts his friends before me. He fights just to leave. One day, he's happy. The next, he's mean and blames me for everything. He can't admit faults. He thinks he's perfect and does no wrong."},{"id":"28_counseling","text":"In the past year, two of my best and only close friends moved to different states. Now I have nobody to hang out with. I'm always alone, and I honestly haven't hung out with anyone since they left. I'm super lonely. What should I do to make new friends? Because they moved and I have no friends now, I think I'm falling into a depression or something. I just need help."},{"id":"29_incel","text":"If you dont have social skills graduating from high school its over buddy boyo."}]